---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.VisGraphicsDesignoptions
source: html/2813ebdb-c01c-a556-4d43-26c7b6f46d27.htm
---
# Autodesk.Revit.DB.ParameterTypeId.VisGraphicsDesignoptions Property

"V/G Overrides Design Options"

## Syntax (C#)
```csharp
public static ForgeTypeId VisGraphicsDesignoptions { get; }
```